Network Working Group                                 Mustapha Aissaoui  
Internet Draft                                         Peter Busschbach 
Expires: August 2009                                     Alcatel-Lucent 
                                                       
                                                              Dave Allan 
                                                                  Nortel 
                                                                         
                                                          Monique Morrow 
                                                            Luca Martini 
                                                      Cisco Systems Inc. 
                                                                         
                                                           Thomas Nadeau 
                                                                      BT 
                                                                         
                                                            Yaakov Stein 
                                                 RAD Data Communications 
                                                                         
                                                                 Editors 
 
                                    
                                                       February 27, 2009 
                                      
                   Pseudo Wire (PW) OAM Message Mapping 
                    draft-ietf-pwe3-oam-msg-map-09.txt 


Status of this Memo 

    

   This Internet-Draft is submitted to IETF in full conformance with the    
   provisions of BCP 78 and BCP 79. 

   Internet-Drafts are working documents of the Internet Engineering   
   Task Force (IETF), its areas, and its working groups.  Note that 
   other groups may also distribute working documents as Internet-
   Drafts. 

   Internet-Drafts are draft documents valid for a maximum of six months 
   and may be updated, replaced, or obsoleted by other documents at any 
   time.  It is inappropriate to use Internet-Drafts as reference 
   material or to cite them other than as "work in progress." 

   The list of current Internet-Drafts can be accessed at 
   http://www.ietf.org/ietf/1id-abstracts.txt. 

   The list of Internet-Draft Shadow Directories can be accessed at   
   http://www.ietf.org/shadow.html. 

   This Internet-Draft will expire on August 27, 2009. 
 
 
 
Nadeau, et al.         Expires August 27, 2009                 [Page 1] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

 Copyright and License Notice 

   Copyright (c) 2009 IETF Trust and the persons identified as the 
   document authors. All rights reserved. 

   This document is subject to BCP 78 and the IETF Trust's Legal 
   Provisions Relating to IETF Documents in effect on the date of 
   publication of this document (http://trustee.ietf.org/license-info).  
   Please review these documents carefully, as they describe your rights 
   and restrictions with respect to this document."      

Abstract 

   This document specifies the mapping and notification of defect states 
   between a Pseudo Wire and the Attachment Circuits (AC) of the end-to-
   end emulated service. This document covers the case whereby the ACs 
   and the PWs are of the same type in accordance to the PWE3 
   architecture [RFC3985] such that a homogenous PW service can be 
   constructed. 

    

Conventions used in this document 

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", 
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this 
   document are to be interpreted as described in RFC-2119. 

Table of Contents 

    
   1. Acknowledgments................................................4 
   2. Contributors...................................................4 
   3. Introduction...................................................5 
   4. Terminology....................................................5 
   5. Reference Model and Defect Locations...........................7 
   6. Abstract Defect States.........................................8 
   7. OAM Models....................................................10 
   8. PW Defect States and Defect Notifications.....................12 
      8.1. PW Defect Notification Mechanisms........................12 
         8.1.1. LDP Status TLV......................................13 
         8.1.2. L2TP Circuit Status AVP.............................14 
         8.1.3. BFD Diagnostic Codes................................16 
      8.2. PW Defect State Entry/Exit...............................18 
         8.2.1. PW receive defect state entry/exit criteria.........18 
         8.2.2. PW transmit defect state entry/exit criteria........19 
   9. Procedures for ATM PW Service.................................19 
 
 
Nadeau, et al.         Expires August 27, 2009                 [Page 2] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

      9.1. AC receive defect state entry/exit criteria..............19 
      9.2. AC transmit defect state entry/exit criteria.............20 
      9.3. Consequent Actions.......................................21 
         9.3.1. PW receive defect state entry/exit..................21 
         9.3.2. PW transmit defect state entry/exit.................22 
         9.3.3. PW defect state in ATM Port Mode PW Service.........22 
         9.3.4. AC receive defect state entry/exit..................22 
         9.3.5. AC transmit defect state entry/exit.................24 
   10. Procedures for Frame Relay PW Service........................24 
      10.1. AC receive defect state entry/exit criteria.............24 
      10.2. AC transmit defect state entry/exit criteria............24 
      10.3. Consequent Actions......................................25 
         10.3.1. PW receive defect state entry/exit.................25 
         10.3.2. PW transmit defect state entry/exit................25 
         10.3.3. PW defect state in the FR Port Mode PW service.....26 
         10.3.4. AC receive defect state entry/exit.................26 
         10.3.5. AC transmit defect state entry/exit................26 
   11. Procedures for TDM PW Service................................26 
      11.1. AC receive defect state entry/exit criteria.............27 
      11.2. AC transmit defect state entry/exit criteria............27 
      11.3. Consequent Actions......................................28 
         11.3.1. PW receive defect state entry/exit.................28 
         11.3.2. PW transmit defect state entry/exit................28 
         11.3.3. AC receive defect state entry/exit.................28 
   12. Procedures for CEP PW Service................................29 
      12.1. Defect states...........................................30 
         12.1.1. PW receive defect state entry/exit criteria........30 
         12.1.2. PW transmit defect state entry/exit criteria.......30 
         12.1.3. AC receive defect state entry/exit criteria........30 
         12.1.4. AC transmit defect state entry/exit criteria.......30 
      12.2. Consequent actions......................................31 
         12.2.1. PW receive defect state entry/exit.................31 
         12.2.2. PW transmit defect state entry/exit................31 
         12.2.3. AC receive defect state entry/exit.................31 
   13. Security Considerations......................................32 
   14. IANA Considerations..........................................32 
   15. References...................................................32 
      15.1. Normative References....................................32 
      15.2. Informative References..................................33 
   16. Editor's Addresses...........................................34 
   Informative Appendix A: Native Service Management................35 
      -  Frame Relay Management.....................................35 
      -  ATM Management.............................................36 
   Informative Appendix B: PW Defects and Detection tools...........37 
      -  PW Defects.................................................37 
         -  Packet Loss.............................................38 
      -  PW Defect Detection Tools..................................38 
 
 
Nadeau, et al.         Expires August 27, 2009                 [Page 3] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

    
1. Acknowledgments  

   The editors would like to acknowledge the important contributions of    
   Hari Rakotoranto, Eric Rosen, Mark Townsley, Michel Khouderchah, 
   Bertrand Duvivier, Vanson Lim, Chris Metz, Ben Washam, Tiberiu 
   Grigoriu, Neil McGill, and Amir Maleki. 

2. Contributors 

   Thomas D. Nadeau, tom.nadeau@bt.com 
    
   Monique Morrow, mmorrow@cisco.com 
    
   Peter B. Busschbach, busschbach@alcatel-lucent.com 
    
   Mustapha Aissaoui, mustapha.aissaoui@alcatel-lucent.com 
    
   Matthew Bocci, matthew.bocci@alcatel-lucent.co.uk 
    
   David Watkinson, david.watkinson@alcatel-lucent.com 
    
   Yuichi Ikejiri, y.ikejiri@ntt.com 
    
   Kenji Kumaki, kekumaki@kddi.com   
       
   Satoru Matsushima, satoru@ft.solteria.net  
    
   David Allan, dallan@nortel.com 
    
   Himanshu Shah, hshah@ciena.com 
    
   Simon Delord, simon.delord@gmail.com 
    
   Vasile Radoaca, vasile.radoaca@alcatel-lucent.com 
    
   Carlos Pignataro, cpignata@cisco.com 
    
   Luca Martini, lmartini@cisco.com 
    
   Yaakov (J) Stein, yaakov_s@rad.com 
    
   Teruyuki Oya, teruyuki.oya@tm.softbank.co.jp 
    



 
 
Nadeau, et al.         Expires August 27, 2009                 [Page 4] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

3. Introduction 

   This document specifies the mapping and notification of defect states 
   between a Pseudo    Wire and the Attachment Circuits (AC) of the end-
   to-end emulated service. It covers the case whereby the ACs and the 
   PWs    are of the same type in accordance to the PWE3 architecture 
   [RFC3985]    such that a homogeneous PW service can be constructed.  

   This document is motivated by the requirements put forth in [RFC4377] 
   and [RFC3916]. Its objective is to standardize the behavior of PEs 
   with respects to failures on PWs and ACs, so that there is no 
   ambiguity about the alarms generated and consequent actions 
   undertaken by PEs in response to specific failure conditions. 

   This document covers PWE over MPLS PSN, PWE over MPLS-IP PSN and PWE 
   over L2TP-IP PSN. 

   The Ethernet PW service is covered in a separate document [ETH-OAM-
   IWK]. 

4. Terminology 

         AIS   Alarm Indication Signal 

         AC    Attachment circuit 

         BDI   Backward Defect Indication 

         CC    Continuity Check 

         CE    Customer Edge 

         CPCS  Common Part Convergence Sub-layer 

         DLC   Data Link Connection 

         FDI   Forward Defect Indication 

         FRBS  Frame Relay Bearer Service 

         IWF   Interworking Function 

         LB    Loopback 

         NE    Network Element 

         NS    Native Service 
 
 
Nadeau, et al.         Expires August 27, 2009                 [Page 5] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

         OAM   Operations and Maintenance 

         PE    Provider Edge 

         PW    Pseudowire 

         PSN   Packet Switched Network 

         RDI   Remote Defect Indication 

         SDU   Service Data Unit 

         VCC   Virtual Channel Connection 

         VPC   Virtual Path Connection 

   The rest of this document will follow the following conventions.  

   The words "defect" and "fault" are used inter-changeably to mean a 
   condition which causes user packets not to be forwarded between the 
   CE endpoints of the PW service. 

   The words "defect notification" and "defect indication" are used 
   inter-changeably to mean an OAM message generated by a PE and sent to 
   other nodes in the network to convey the defect state local to this 
   PE. 

   The PW can ride over three types of Packet Switched Network (PSN). A 
   PSN which makes use of LSPs as the tunneling technology to forward 
   the PW packets will be referred to as an MPLS PSN. A PSN which makes 
   use of MPLS-in-IP tunneling [RFC4023], with an MPLS shim header used 
   as PW demultiplexer, will be referred to as an MPLS-IP PSN. A PSN 
   which makes use of L2TPv3 [RFC3931] as the tunneling technology with 
   the L2TPv3 Session ID as the PW demultiplexer will be referred to as 
   L2TP-IP PSN. 

   If LSP-Ping [RFC4379] is run over a PW as described in [RFC4377], it 
   will be referred to as VCCV-Ping. 

   If BFD is run over a PW as described in [RFC4377], it will be 
   referred to as VCCV-BFD [VCCV-BFD]. 

   In the context of this document a PE forwards packets between an AC 
   and a PW. The other PE that terminates the PW is the peer PE or 
   remote PE and the attachment circuit associated with the far-end PW 
   termination is the remote AC. 

 
 
Nadeau, et al.         Expires August 27, 2009                 [Page 6] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

   Defects are discussed in the context of defect states, and the 
   criteria to enter and exit the defect state. The direction of defects 
   is discussed from the perspective of the observing PE. 

   A receive defect is one that impacts information transfer to the 
   observing PE. It impacts the observing PEs ability to receive 
   information.  

   A transmit defect is one that uniquely impacts information sent or 
   relayed by the observing PE.  

   A receive defect generally also impacts information sent or relayed 
   by the observing PE. Therefore the receive defect state is considered 
   to be a superset of the two defect states. Thus, when a PE enters 
   both receive and transmit defect states related to the same PW 
   service, the receive defect takes precedence over the transmit defect 
   in terms of the consequent actions. 

   A forward defect indication is sent in the same direction as the user 
   traffic impacted by the defect. A reverse defect indication is sent 
   in the opposite direction of the traffic impacted by the defect. 

5. Reference Model and Defect Locations 

   Figure 1 illustrates the PWE3 network reference model with an 
   indication of the possible defect locations. This model will be 
   referenced in the remainder of this document for describing the OAM 
   procedures. 

    

    
         
               ACs             PSN tunnel            ACs 
                      +----+                  +----+ 
      +----+          | PE1|==================| PE2|          +----+ 
      |    |---(a)---(b)..(c)......PW1..(d)..(c)..(f)---(e)---|    | 
      | CE1|   (N1)   |    |                  |    |    (N2)  |CE2 | 
      |    |----------|............PW2.............|----------|    | 
      +----+          |    |==================|    |          +----+ 
           ^          +----+                  +----+          ^ 
           |      Provider Edge 1         Provider Edge 2     | 
           |                                                  | 
           |<-------------- Emulated Service ---------------->| 
     Customer                                                Customer 
      Edge 1                                                  Edge 2 
                  Figure 1: PWE3 Network Defect Locations 
 
 
Nadeau, et al.         Expires August 27, 2009                 [Page 7] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

   In all interworking scenarios described in this document, it is 
   assumed the AC and the PW are of the same type at PE1. The procedures 
   described in this document apply to PE1. PE2 implements the identical 
   functionality for a homogeneous service (although it is not required 
   to as long as the notifications across the PWs are consistent). 

   The following is a brief description of the defect locations: 

       a. Defect in the first native service network (N1). This covers 
          any defect in the N1 which impacts all or a subset of ACs 
          terminating in PE1. The defect is conveyed to PE1 and to the 
          remote native service network (N2) using the native service 
          specific OAM defect indication. 
       b. Defect on a PE1 AC interface. 
       c. Defect on a PE1 PSN interface. 
       d. Defect in the PSN network. This covers any defect in the PSN 
          which impacts all or a subset of PWs terminating in a PE. The 
          defect is conveyed to the PE using a PSN and/or a PW specific 
          OAM defect indication. Note that both data plane defects and 
          control plane defects must be taken into consideration. Even 
          though control messages may follow a different path than the 
          PW data plane traffic, a control plane failure may affect the 
          PW status. 
       e. Defect in the second native service network (N2). This covers 
          any defect in N2 which impacts all or a subset of ACs 
          terminating in PE2 (which is considered a remote AC defect in 
          the context of procedures outlined in this draft). The defect 
          is conveyed to PE2 and to the remote native service network 
          (N1) using the native service OAM defect indication. 
       f. Defect on a PE2 AC interface (which is also considered a 
          remote AC defect in the context of this draft). 
    
6. Abstract Defect States 

   PE1 must track four defect states that reflect the observed states of 
   both directions of the PW service on both the AC and the PW sides. 
   Defects may impact one or both directions of the PW service. 

   The observed state is a combination of defects directly detected by 
   PE1 and defects it has been made aware of via notifications. 

    

    

    

 
 
Nadeau, et al.         Expires August 27, 2009                 [Page 8] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

                              +-----+ 
           ----AC receive---->|     |-----PW transmit----> 
     CE1                      | PE1 |                       PE2/CE2 
           <---AC transmit-----|     |<----PW receive----- 
                              +-----+  
    
     (arrows indicate direction of user traffic impacted by a defect) 
               Figure 2: Receive and Transmit Defect States  

   PE1 will directly detect or be notified of AC receive or PW receive 
   defects as they occur upstream of PE1 and impact traffic being sent 
   to PE1. As a result, PE1 enters the AC or PW receive defect state.  

   In Figure 2, PE1 may be notified of a receive defect in the AC by 
   receiving a Forward Defect indication, e.g., ATM AIS, from an ATM 
   switch in network N1. This defect notification indicates that user 
   traffic sent by CE1 may not be received by PE1 due to a defect. PE1 
   can also directly detect an AC receive defect if it resulted from a 
   failure of the receive side in the local port or link over which the 
   AC is configured.   

   Similarly, PE1 may detect or be notified of a receive defect in the 
   PW by receiving a Forward Defect indication from PE2. If PW status is 
   used for fault notification, this message will indicate a Local PSN-
   facing PW (egress) Transmit Fault or a Local Attachment Circuit 
   (ingress) Receive Fault at PE2, as described in Section 8.1.1. . This 
   defect notification indicates that user traffic sent by CE2 may not 
   be received by PE1 due to a defect. As a result, PE1 enters the PW 
   receive defect state.   

   Note that a Forward Defect indication is sent in the same direction 
   as the user traffic impacted by the defect. 

   Generally, a PE cannot detect transmit defects directly and will 
   therefore need to be notified of AC transmit or PW transmit defects 
   by other devices.  

   In Figure 2, PE1 may be notified of a transmit defect in the AC by 
   receiving a Reverse Defect indication, e.g., ATM RDI, from CE1. This 
   defect relates to the traffic sent by PE1 to CE1 on the AC.   

   Similarly, PE1 may be notified of a transmit defect in the PW by 
   receiving a Reverse Defect indication from PE2. If PW status is used 
   for fault notification, this message will indicate a Local PSN-facing 
   PW (ingress) Receive Fault or a Local Attachment Circuit (egress) 
   Transmit Fault at PE2, as described in Section 8.1.1. . This defect 

 
 
Nadeau, et al.         Expires August 27, 2009                 [Page 9] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

   impacts the traffic sent by PE1 to CE2. As a result, PE1 enters the 
   PW transmit defect state.  

   Note that a Reverse Defect indication is sent in the reverse 
   direction to the user traffic impacted by the defect. 

   The procedures outlined in this document define the entry and exit 
   criteria for each of the four states with respect to the set of PW 
   services within the document scope and the consequent actions that 
   PE1 must perform.  

   When a PE enters both receive and transmit defect states related to 
   the same PW service, then the receive defect takes precedence over 
   transmit defect in terms of the consequent actions. 

7. OAM Models 

   A homogeneous PW service forwards packets between an AC and a PW of 
   the same type. It thus implements both a Native Service OAM 
   mechanism and a PW OAM mechanism. PW OAM defect notification 
   messages are described in Section 8.1.  Native Service (NS) OAM 
   messages are described in Appendix A. 
    
   This document defines two different modes for operating OAM on a PW 
   service which dictate the mapping between the NS OAM the PW OAM 
   defect notification messages.  
    
   The first one operates a single emulated OAM loop end-to-end between 
   the endpoints of the PW service. This is referred to as "single 
   emulated OAM loop" mode and is illustrated in Figure 3. 
    
       |<----- AC ----->|<----- PW ----->|<----- AC ----->| 
       |                |                |                |  
                     ___ ===============_     
     |CE|---=NS-OAM=>---(---=NS-OAM=>---)---=NS-OAM=>---|CE| 
                         ===============     / 
                            \               /  
                             ---=PW-OAM=>--- 
    
                  Figure 3: Single Emulated OAM Loop mode 

   This mode implements the following behavior. We use the words 
   upstream and downstream to identify PEs in relation to a specific 
   traffic direction. 
        a. An upstream PE node MUST transparently relay NS OAM messages 
          over the PW. 

 
 
Nadeau, et al.         Expires August 27, 2009                [Page 10] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

        b. An upstream PE node MUST signal local failures affecting the 
          AC using a NS defect notification OAM message sent over the 
          PW. In the case that it is not possible to generate NS OAM 
          messages (e.g. because the defect interferes with NS OAM 
          message generation) the PE MUST signal local failures 
          affecting the AC using a PW defect notification OAM message. 
        c. An upstream PE node MUST signal local failures affecting the 
          PW using a PW defect notification OAM message. 
        d. A downstream PE node MUST insert a NS defect notification OAM 
          message into the AC when it detects or is notified of a 
          defect in the PW or remote AC. This includes receiving a PW 
          defect notification message and translating it into a NS 
          defect notification OAM message over the AC. The latter is 
          required for handling defects signaled by a peer PE with PW 
          OAM messaging. 
    
   The "single emulated OAM loop" mode is suitable for PW services 
   which have a widely deployed NS OAM mechanism that operates within 
   the AC. This document specifies the use of this mode for ATM PW, TDM 
   PW, and CEP PW services. It is the default mode of operation for all 
   ATM cell-mode PW services and the only mode specified for TDM and 
   CEP PW services. It is optional for AAL5 PDU transport and AAL5 SDU 
   transport modes. 
    
   The second mode operates three OAM loops which join at the AC/PW 
   boundary of a PE. This is referred to as "coupled OAM loops" mode 
   and is illustrated in Figure 4. 
                                      
       |<----- AC ----->|<----- PW ----->|<----- AC ----->| 
       |                |                |                |  
                      __ ===============__     
     |CE|---=NS-OAM=>---(---------------)---=NS-OAM=>---|CE| 
                    \    ===============       / 
                     \                        / 
                      \                      / 
                       -------=PW-OAM=>------ 
    
                     Figure 4: Coupled OAM Loops mode 

   This mode implements the following behavior. We use the words 
   upstream and downstream to identify PEs in relation to a specific 
   traffic direction. 
        a. An upstream PE node MUST terminate and translate a received 
          NS defect notification OAM message to a PW defect 
          notification message. 


 
 
Nadeau, et al.         Expires August 27, 2009                [Page 11] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

        b. An upstream PE node MUST signal local failures affecting the 
          AC using a PW defect notification OAM message to the remote 
          PE. 
        c. An upstream PE node MUST signal local failures affecting the 
          PW using a PW defect notification OAM message. 
        d. A downstream PE node MUST insert a NS defect notification OAM 
          message into the AC when it detects or is notified of a 
          defect in the PW or remote AC. This includes support 
          receiving a PW defect notification message and translating it 
          into a NS defect notification OAM message over the AC. 
    
   This document specifies the "coupled OAM loops" mode as the default 
   mode for a FR PW service and for ATM AAL5 PDU transport and AAL5 SDU 
   transport services and as optional for ATM VCC cell mode services. 
   It does not specify the use of this mode for TDM PW, CEP PW, and ATM 
   VPC cell mode PW services. In the latter last case, a PE node must 
   pass transparently VC-level (F5) ATM OAM cells over the PW while 
   terminating and translating VP-level (F4) OAM cells. Thus, it cannot 
   operate a pure "coupled OAM loops" mode. 
    
8. PW Defect States and Defect Notifications 

8.1. PW Defect Notification Mechanisms 

   For a MPLS PSN and a MPLS-IP PSN, a PE node which establishes a PW 
   using LDP SHALL use LDP status TLV as the mechanism for AC and PW 
   status and defect notification [RFC4447]. Additionally, a PE node MAY 
   use VCCV-BFD Connectivity Verification (CV) types for fault detection 
   only but SHOULD notify the remote PE using LDP Status TLV. These CV 
   types are 0x04 and 0x10 [VCCV-BFD]. 

   A PE node which establishes a PW using other means than LDP, e.g., 
   static configuration, MAY use VCCV-BFD CV types for AC and PW status 
   and defect notification. These CV types are 0x08 and 0x20 [VCCV-BFD]. 
   These CV types SHOULD NOT be used when the PW is established with the 
   LDP control plane. 

   For a L2TP-IP PSN, A PE node SHOULD use the Circuit Status AVP as the 
   mechanism for AC and PW status and defect notification. In its most 
   basic form, the Circuit Status AVP [RFC3931] in a Set-Link-Info (SLI) 
   message can signal active/inactive AC status. The Circuit Status AVP 
   is proposed to be extended to convey status and defects in the AC and 
   the PSN-facing PW in both ingress and egress directions, i.e., four 
   independent status bits without the need to tear down the sessions or 
   control connection [L2TP-Status]. 


 
 
Nadeau, et al.         Expires August 27, 2009                [Page 12] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

   When a PE does not support the Circuit Status AVP, it MAY use the 
   StopCCN and the CDN message to bring down L2TP sessions in a similar 
   way LDP uses the Label Withdrawal to bring down a PW. A PE node may 
   use the StopCCN to shutdown the L2TP control connection, and 
   implicitly all L2TP sessions associated with that control connection 
   without any explicit session control messages. This is in the case of 
   a failure which impacts all L2TP sessions, i.e., all PWs, managed by 
   the control connection. It may use the CDN message to disconnect a 
   specific L2TP session when a failure affects a specific PW.  

   Additionally, a PE node MAY use VCCV-BFD CV types 0x04 and 0x10 for 
   fault detection only but SHOULD notify the remote PE using the 
   Circuit Status AVP. A PE node which establishes a PW using other 
   means than L2TP control plane MAY use VCCV-BFD CV types 0x08 and 0x20 
   for AC and PW status and defect notification. These CV types SHOULD 
   NOT be used when the PW is established with the L2TP control plane. 

8.1.1. LDP Status TLV 

   [RFC4446] defines the following PW status code points: 

   0x00000000 - Pseudo Wire forwarding (clear all failures) 
   0x00000001 - Pseudo Wire Not Forwarding 
   0x00000002 - Local Attachment Circuit (ingress) Receive Fault 
   0x00000004 - Local Attachment Circuit (egress) Transmit Fault 
   0x00000008 - Local PSN-facing PW (ingress) Receive Fault 
   0x00000010 - Local PSN-facing PW (egress) Transmit Fault 
    

   [RFC4447] specifies that "Pseudo Wire forwarding" code point is used 
   to clear all faults. It also specifies that "Pseudo Wire Not 
   Forwarding" code is used to convey any other defect that cannot be 
   represented by the other code points.  

   The code points used in the LDP status TLV in a PW status 
   notification message convey the defect view of the originating PE.  

   The originating PE conveys this state in the form of a forward defect 
   or a reverse defect indication. 

   The forward and reverse defect indication definitions used in this 
   document map to the LDP Status TLV codes as follows: 

            Forward defect indication - corresponds to the logical OR of 

                   Local Attachment Circuit (ingress) Receive Fault, 

 
 
Nadeau, et al.         Expires August 27, 2009                [Page 13] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

                   Local PSN-facing PW (egress) Transmit Fault, and 

                   PW not Forwarding Fault 

                             

            Reverse defect indication - corresponds to the logical OR of 

                   Local Attachment Circuit (egress) Transmit Fault and 

                   Local PSN-facing PW (ingress) Receive Fault 

                             

   A PE SHALL thus use PW status notification messages to report all 
   failures affecting the PW service including, but not restricted, to 
   the following: 

            - Failures detected through defect detection mechanisms in 
              the MPLS and MPLS-IP PSN 

            - Failures detected through VCCV-Ping or VCCV-BFD CV types 
              0x04 and 0x10 for fault detection only 

            - Failures within the PE that result in an inability to 
              forward traffic between the AC and the PW 

            - Failures of the AC or in the L2 network affecting the AC 
              as per the rules detailed in Section 7. for the "single 
              emulated OAM loop" mode and "coupled OAM loops" mode. 

   Note that there are two situations which require PW label withdrawal 
   as opposed to a PW status notification by the PE. The first one is 
   when the PW is taken administratively down in accordance to 
   [RFC4447]. The second one is when the Target LDP session established 
   between the two PEs is lost. In the latter case, the PW labels will 
   need to be re-signaled when the Targeted LDP session is re-
   established. 

8.1.2. L2TP Circuit Status AVP 

   [RFC3931] defines the Circuit Status AVP in the Set-Link-Info (SLI) 
   message to exchange initial status and status changes in the circuit 
   to which the pseudowire is bound. [L2TP-Status] defines extensions to 
   the Circuit Status AVP that are analogous to the PW Status TLV 
   defined for LDP.  Consequently, for L2TP-IP, the Circuit Status AVP 

 
 
Nadeau, et al.         Expires August 27, 2009                [Page 14] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

   is used in the same fashion as the PW Status described in the 
   previous section. 

   If the extended Circuit Status bits are not supported, and instead 
   only the "A-bit" (Active) is used as described in [RFC3931], a PE MAY 
   use CDN messages to clear L2TPv3 sessions in the presence of session-
   level failures detected in the L2TP-IP PSN. 

   A PE MUST set the Active bit in the Circuit Status to clear all 
   faults, and it MUST clear the Active bit in the Circuit Status to 
   convey any defect that cannot be represented explicitly with specific 
   Circuit Status flags from [RFC3931] or [L2TP-Status].   

   The forward and reverse defect indication definitions used in this 
   document map to the L2TP Circuit Status AVP as follows: 

           Forward defect indication - corresponds to the logical OR of 

                   Local Attachment Circuit (ingress) Receive Fault, 

                   Local PSN-facing PW (egress) Transmit Fault, and 

                   PW not Forwarding Fault 

           Reverse defect indication- corresponds to the logical OR of 

                   Local Attachment Circuit (egress) Transmit Fault and 

                   Local PSN-facing PW (ingress) Receive Fault 

                             

   The status notification conveys the defect view of the originating 
   LCCE (PE). 

   When the extended Circuit Status definition of [L2TP-Status] is 
   supported, a PE SHALL use the Circuit Status to report all failures 
   affecting the PW service including, but not restricted, to the 
   following: 

            - Failures detected through defect detection mechanisms in 
              the L2TP-IP PSN. 

            - Failures detected through VCCV-Ping or VCCV-BFD CV types 
              0x04 and 0x10 for fault detection only 


 
 
Nadeau, et al.         Expires August 27, 2009                [Page 15] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

            - Failures within the PE that result in an inability to 
              forward traffic between the AC and the PW 

            - Failures of the AC or in the L2 network affecting the AC 
              as per the rules detailed in Section 7. for the "single 
              emulated OAM loop" mode and the "coupled OAM loops" mode. 

   When the extended Circuit Status definition of [L2TP-Status] is not 
   supported, a PE SHALL use the A-bit in the Circuit Status AVP in SLI 
   to report: 

            - Failures of the AC or in the L2 network affecting the AC 
              as per the rules detailed in Section 7. for the "single 
              emulated OAM loop" mode and the "coupled OAM loops" mode. 

   When the extended Circuit Status definition of [L2TP-Status] is not 
   supported, a PE MAY use the CDN and StopCCN messages in a similar way 
   to an MPLS PW label withdrawal to report: 

            - Failures detected through defect detection mechanisms in 
              the L2TP-IP PSN (using StopCCN) 

            - Failures detected through VCCV (pseudowire level) (using 
              CDN) 

            - Failures within the PE that result in an inability to 
              forward traffic between ACs and PW (using CDN) 

   For ATM L2TPv3 pseudowires, in addition to the Circuit Status AVP, a 
   PE MAY use the ATM Alarm Status AVP [RFC4454] to indicate the reason 
   for the ATM circuit status and the specific alarm type, if any.  This 
   AVP is sent in the SLI message to indicate additional information 
   about the ATM circuit status. 

   L2TP control connections use Hello messages as a keepalive facility. 
   It is important to note that if a PSN failure is such that the loss 
   of conectivity is detected when it triggers a keepalive timeouts, the 
   control connection is cleared.  L2TP Hello messages are sent in-band 
   with the dataplane, with respect to the source and destination 
   addresses, IP protocol number and UDP port (when UDP is used). 

8.1.3. BFD Diagnostic Codes 

   [BFD] defines a set of diagnostic codes that partially overlap with 
   failures that can be communicated through LDP Status TLV or L2TP 
   Circuit Status AVP. This section describes the behavior of the PE 

 
 
Nadeau, et al.         Expires August 27, 2009                [Page 16] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

   nodes with respect to using one or both methods for detecting and 
   propagating defect state. 

   For a MPLS-PSN, the PEs negotiate the use of the VCCV capabilities 
   when the label mapping messages are exchanged to establish the two 
   directions of the PW. An OAM capability TLV is signaled as part of 
   the PW FEC interface parameters TLV. For L2TP-IP PSNs, the PEs 
   negotiate the use of VCCV during the pseudowire session 
   initialization using the VCCV AVP [RFC5085]. 

   The CV Type Indicators field in this TLV defines a bitmask used to 
   indicate the specific OAM capabilities that the PE can make use of 
   over the PW being established.  

   A CV type of 0x04 or 0x10 indicates that BFD is used for PW fault 
   detection only [VCCV-BFD]. These CV types MAY be used any time the PW 
   is established using LDP or L2TP control planes. 

   In this mode, only the following diagnostic (Diag) codes specified in 
   [BFD] will be used, they are: 

      0 - No diagnostic: 

      1 - Control detection time expired 

      7 - Administratively Down 

   A PE MUST use code 0 to indicate to its peer PE that is correctly 
   receiving BFD control messages. It MUST use the second code to 
   indicate that to its peer it has stopped receiving BFD control 
   messages. A PE shall use "Administrative down" to bring down the BFD 
   session when the PW is brought down administratively. All other 
   defects, such as AC/PW defects and PE internal failures that prevent 
   it from forwarding traffic, MUST be communicated through LDP Status 
   TLV in the case of MPLS PSN or MPLS-IP PSN, or through the 
   appropriate L2TP codes in the Circuit Status AVP in the case of L2TP-
   IP PSN. 

   A CV type of 0x08 or 0x20 in the OAM capabilities TLV indicates that 
   BFD is used for both PW fault detection and Fault Notification. In 
   addition to the above diagnostic codes, a PE used the following codes 
   to signal AC defects and other defects impacting forwarding over the 
   PW service: 

      6 -- Concatenated Path Down 

      8 -- Reverse Concatenated Path Down 
 
 
Nadeau, et al.         Expires August 27, 2009                [Page 17] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

      TBD -- PW not forwarding 

   A PE MAY use the "PW not forwarding" code to convey any other defect 
   that cannot be represented by code points 6 and 8. In general, this 
   applies to a defect that does not cause the PW to be torn down. This 
   implies the BFD session must not be brought down when this defect 
   exists. 

   The forward and reverse defect indication definitions used in this 
   document map to the BFD codes as follows: 

           Forward defect indication - corresponds to the logical OR of 

                          Concatenated Path Down and PW not forwarding 

           Reverse defect indication- corresponds to Reverse  

                           Concatenated Path Down 

   These diagnostic codes are used to signal receive and reverse defect 
   states respectively when the PEs negotiated the use of BFD as the 
   mechanism for AC and PW fault detection and status signaling 
   notification. As stated in Section 8.1. , these CV types SHOULD NOT 
   be used when the PW is established with the LDP or L2TP control 
   plane. 

8.2. PW Defect State Entry/Exit 

8.2.1. PW receive defect state entry/exit criteria 

   PE1 will enter the PW receive defect state if one or more of the 
   following occurs: 

            - It receives a forward defect indication from PE2, which 
              indicates PE2 detected or was notified of a PW fault 
              downstream of it or that there was a receive defect on 
              remote AC. 

            - It detects loss of connectivity on the PSN tunnel 
              upstream of PE1 which affects the traffic it receives 
              from PE2. 

            - It detects a loss of PW connectivity through VCCV-BFD or 
              VCCV-PING which affects the traffic it receives from PE2. 

   Note that if the PW control session between the PEs fails, the PW is 
   torn down and needs to be re-established. This includes failure of 
 
 
Nadeau, et al.         Expires August 27, 2009                [Page 18] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

   the T-LDP session, the L2TP session, or the L2TP control connection. 
   However, the consequent actions towards the ACs are the same as if 
   the PW entered the receive defect state. 

   PE1 will exit the PW receive defect state when the following 
   conditions are true. Note that this may result in a transition to the 
   PW operational state or the PW transmit defect state. 

            - All defects it had previously detected have disappeared, 
              and 

            - PE2 cleared the forward defect indication if applicable.  

8.2.2. PW transmit defect state entry/exit criteria 

   PE1 will enter the PW transmit defect state if the following 
   conditions are true: 

            - it receives a reverse defect indication from PE2 which 
              indicates that PE2 detected or was notified of a PW fault 
              upstream of it or that there was a transmit fault on the 
              remote AC, and  

            - it is not already in the PW receive defect state. 

   PE1 will exit the transmit defect state if it receives an OAM message 
   from PE2 clearing the reverse defect indication, or it has entered 
   the PW receive defect state. 

   For a PWE3 over a L2TP-IP PSN using the basic Circuit Status AVP 
   [RFC3931], the PW transmit defect state is not valid and a PE can 
   only enter the PW receive defect state. 

    

9. Procedures for ATM PW Service 

9.1. AC receive defect state entry/exit criteria 

   When operating in the "coupled OAM loops" mode, PE1 enters the AC 
   receive defect state if any of the following conditions are met: 

               a. It detects or is notified of a physical layer fault on 
                 the ATM interface. 

               b. It receives an end-to-end F4 AIS OAM flow on a VP AC, 
                 or an end-to-end F5 AIS OAM flow on a VC AC, 
 
 
Nadeau, et al.         Expires August 27, 2009                [Page 19] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

                 indicating that the ATM VPC or VCC is down in the 
                 adjacent L2 ATM network. 

               c. It receives a segment F4 AIS OAM flow on a VP AC, or a 
                 segment F5 AIS OAM flow on a VC AC,  provided that the 
                 operator has provisioned segment OAM and the PE is not 
                 a segment end-point  

               d. It detects loss of connectivity on the ATM VPC/VCC 
                 while terminating segment or end-to-end ATM continuity 
                 check (ATM CC) cells with the local ATM network and 
                 CE. 

   When operating in the "coupled OAM loops" mode, PE1 exits the AC 
   Receive defect state when all defects it had previously detected have 
   disappeared.  

   When operating in the "single emulated OAM loop" mode, PE1 enters the 
   AC receive defect state if any of the following conditions are met: 

               a. It detects or is notified of a physical layer fault on 
                 the ATM interface. 

               b. It detects loss of connectivity on the ATM VPC/VCC 
                 while terminating segment ATM continuity check (ATM 
                 CC) cells with the local ATM network and CE. 

   When operating in the "single emulated OAM loop" mode, PE1 exits the 
   AC receive defect state when all defects it had previously detected 
   have disappeared. 

   The exact conditions under which a PE enters and exits the AIS state, 
   or declares that connectivity is restored via ATM CC are defined in 
   Section 9.2 of ITU-T Recommendation I.610 [ITU-T I.610]. 

9.2. AC transmit defect state entry/exit criteria 

   When operating in the coupled-loop mode, PE1 enters the AC transmit 
   defect state if any of the following conditions are met: 

               a. It terminates an end-to-end F4 RDI OAM flow, in the 
                 case of a VPC, or an end-to-end F5 RDI OAM flow, in 
                 the case of a VCC, indicating that the ATM VPC or VCC 
                 is down in the adjacent L2 ATM. 

               b. It receives a segment F4 RDI OAM flow on a VP AC, or a 
                 segment F5 RDI OAM flow on a VC AC,  provided that the 
 
 
Nadeau, et al.         Expires August 27, 2009                [Page 20] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

                 operator has provisioned segment OAM and the PE is not 
                 a segment end-point  

   PE1 exits the AC transmit defect state if the AC state transitions to 
   working or to the AC receive defect state. The exact conditions for 
   exiting the RDI state are described in Section 9.2 of ITU-T 
   Recommendation I.610 [ITU-T I.610]. 

   Note that the AC transmit defect state is not valid when operating in 
   the "single emulated OAM loop" mode as PE1 transparently forwards the 
   received RDI cells as user cells over the ATM PW to the remote CE. 

9.3. Consequent Actions 

   In the reminder of this section, the text refers to AIS, RDI and CC 
   without specifying whether it is an F4 (VP-level) flow or an F5 (VC-
   level) flow, or whether it is an end-to-end or a segment flow.  
   Precise ATM OAM procedures for each type of flow are specified in 
   Section 9.2 of ITU-T Recommendation I.610 [ITU-T I.610]. 

9.3.1. PW receive defect state entry/exit 

   On entry to the PW receive defect state: 

              a. PE1 MUST commence AIS insertion into the corresponding 
                 AC. 

              b. PE1 MUST cease generation of CC cells on the 
                 corresponding AC, if applicable. 

              c. If the PW failure was detected by PE1 without 
                 receiving a forward defect indication from PE2, PE1 
                 MUST assume PE2 has no knowledge of the defect and 
                 MUST notify PE2 in the form of a reverse defect 
                 indication. 

   On exit from the PW receive defect state: 

               a. PE1 MUST cease AIS insertion into the corresponding 
                 AC. 

               b. PE1 MUST resume any CC cell generation on the 
                 corresponding AC, if applicable. 

               c. PE1 MUST clear the reverse defect indication to PE2 if 
                 applicable. 

 
 
Nadeau, et al.         Expires August 27, 2009                [Page 21] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

9.3.2. PW transmit defect state entry/exit 

   On entry to the PW Transmit Defect State: 

               a. PE1 MUST commence RDI insertion into the corresponding 
                 AC. 

               b. If the PW failure was detected by PE1 without 
                 receiving a reverse defect indication from PE2, PE1 
                 MUST assume PE2 has no knowledge of the defect and 
                 MUST notify PE2 in the form of a forward defect 
                 indication. 

   On exit from the PW Transmit Defect State: 

               a. PE1 MUST cease RDI insertion into the corresponding 
                 AC. 

               b. PE1 MUST clear the forward defect indication to PE2 if 
                 applicable. 

9.3.3. PW defect state in ATM Port Mode PW Service 

   In case of transparent cell transport PW service, i.e., "port mode", 
   where the PE does not keep track of the status of individual ATM VPCs 
   or VCCs, a PE cannot relay PW defect state over these VCCs and VPCs. 
   If ATM CC is run on the VCCs and VPCs end-to-end (CE1 to CE2), or on 
   a segment originating and terminating in the ATM network and spanning 
   the PSN network, it will timeout and cause the CE or ATM switch to 
   enter the ATM AIS state. 

9.3.4. AC receive defect state entry/exit 

   On entry to the AC receive defect state and when operating in the 
   "coupled OAM loops" mode: 

               a. PE1 MUST send a forward defect indication to PE2. 

               b. PE1 MUST commence insertion of ATM RDI cells into the 
                 AC towards CE1. 

   When operating in the "single emulated OAM loop" mode, PE1 must be 
   able to support two options, subject to the operator's preference. 
   The default option is the following: 

   On entry to the AC receive defect state: 

 
 
Nadeau, et al.         Expires August 27, 2009                [Page 22] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

               a. PE1 MUST transparently relay ATM AIS cells, or, in the 
                 case of a local AC defect, commence insertion of ATM 
                 AIS cells into the corresponding PW towards CE2. 

               b. If the defect interferes with NS OAM message 
                 generation, PE1 MUST send a forward defect indication 
                 to PE2. 

               c. PE1 MUST cease the generation of CC cells on the 
                 corresponding PW, if applicable. 

   In certain operational models, for example in the case that the ATM 
   access network is owned by a different provider than the PW, an 
   operator may want to distinguish between defects detected in the ATM 
   access network and defects detected on the AC directly adjacent to 
   the PE. Therefore, the following option must also be supported: 

               a. Upon reception of AIS on the AC, PE1 MUST commence 
                 insertion of ATM AIS cells into the corresponding PW 
                 towards CE2. 

               b. Upon detection of a defect on the ATM interface on the 
                 PE or in the PE itself, PE1 MUST send a forward defect 
                 indication to PE2. 

               c. PE1 MUST cease generation of CC cells on the 
                 corresponding PW, if applicable. 

   On exit from the AC receive defect state and when operating in the 
   "coupled OAM loops" mode:  

               a. PE1 MUST clear the forward defect indication to PE2. 

               b. PE1 MUST cease insertion of ATM RDI cells into the AC. 

   On exit from the AC receive defect state and when operating in the 
   "single emulated OAM loop" mode: 

               a. PE1 MUST cease insertion of ATM AIS cells into the 
                 corresponding PW. 

               b. PE1 MUST clear the forward defect indication to PE2 if 
                 applicable. 

               c. PE1 MUST resume any CC cell generation on the 
                 corresponding PW, if applicable. 

 
 
Nadeau, et al.         Expires August 27, 2009                [Page 23] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

9.3.5. AC transmit defect state entry/exit 

   On entry to the AC transmit defect state and when operating in the 
   "coupled OAM loops" mode: 

               a. PE1 MUST send a reverse defect indication to PE2. 

   On exit from the AC transmit defect state and when operating in the 
   "coupled OAM loops" mode:  

               a. PE1 MUST clear the reverse defect indication to PE2. 

10. Procedures for Frame Relay PW Service 

10.1. AC receive defect state entry/exit criteria 

   PE1 enters the AC receive defect state if one or more of the 
   following conditions are true: 

               a. A PVC is not deleted from the Frame Relay network and 
                 the Frame Relay network explicitly indicates in a full 
                 status report (and optionally by the asynchronous 
                 status message) that this Frame Relay PVC is inactive 
                 [ITU-T Q.933]. In this case, this status maps across 
                 the PE to the corresponding PW only. 

               b. The Link Integrity Verification (LIV) indicates that 
                 the link from the PE to the Frame Relay network is 
                 down [ITU-T Q.933]. In this case, the link down 
                 indication maps across the PE to all corresponding 
                 PWs. 

               c. A physical layer alarm is detected on the FR 
                 interface. In this case, this status maps across the 
                 PE to all corresponding PWs.  

   PE1 exits the AC receive defect state when all defects it had 
   previously detected have disappeared. 

10.2. AC transmit defect state entry/exit criteria 

   The AC transmit defect state is not valid for a FR AC. 





 
 
Nadeau, et al.         Expires August 27, 2009                [Page 24] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

10.3. Consequent Actions 

10.3.1. PW receive defect state entry/exit 

   On entry to the PW receive defect state: 

               a. PE1 MUST set the Active bit = 0 for the corresponding 
                 FR AC in a full status report, and optionally in an 
                 asynchronous status message, as per Q.933 annex A 
                 [ITU-T Q.933].  

               b. If the PW failure was detected by PE1 without 
                 receiving a forward defect indication from PE2, PE1 
                 MUST assume PE2 has no knowledge of the defect and 
                 MUST notify PE2 in the form of a reverse defect 
                 indication. 

   On exit from the PW receive defect state: 

               a. PE1 MUST set the Active bit = 1 for the corresponding 
                 FR AC in a full status report, and optionally in an 
                 asynchronous status message, as per Q.933 annex A. PE1 
                 does not apply this procedure on a transition from the 
                 PW receive defect state to the PW transmit defect 
                 state. 

               b. PE1 MUST clear the reverse defect indication to PE2 if 
                 applicable. 

10.3.2. PW transmit defect state entry/exit 

   On entry to the PW transmit defect state: 

               a. PE1 MUST set the Active bit = 0 for the corresponding 
                 FR AC in a full status report, and optionally in an 
                 asynchronous status message, as per Q.933 annex A.  

               b. If the PW failure was detected by PE1 without 
                 receiving a reverse defect indication from PE2, PE1 
                 MUST assume PE2 has no knowledge of the defect and 
                 MUST notify PE2 in the form of a forward defect 
                 indication. 

   On exit from the PW transmit defect state: 

               a. PE1 MUST set the Active bit = 1 for the corresponding 
                 FR AC in a full status report, and optionally in an 
 
 
Nadeau, et al.         Expires August 27, 2009                [Page 25] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

                 asynchronous status message, as per Q.933 annex A. PE1 
                 does not apply this procedure on a transition from the 
                 PW transmit defect state to the PW receive defect 
                 state. 

               b. PE1 MUST clear the forward defect indication to PE2 if 
                 applicable. 

10.3.3. PW defect state in the FR Port Mode PW service 

   In case of port mode PW service, STATUS ENQUIRY and STATUS messages 
   are transported transparently over the PW. A PW Failure will 
   therefore result in timeouts of the Q.933 link and PVC management 
   protocol at the Frame Relay devices at one or both sites of the 
   emulated interface. 

10.3.4. AC receive defect state entry/exit 

   On entry to the AC receive defect state: 

               a. PE1 MUST send a forward defect indication to PE2. 

   On exit from the AC receive defect state:  

               a. PE1 MUST clear the forward defect indication to PE2. 

10.3.5. AC transmit defect state entry/exit 

   The AC transmit defect state is not valid for a FR AC. 

11. Procedures for TDM PW Service 

   The following procedures apply to SAToP ([RFC4553]), CESoPSN 
   ([RFC5086]) and TDMoIP ([RFC5087]). These technologies generally 
   utilize the single-emulated loop mode (see section 7). Note that 
   TDMoIP distinguishes between trail-extended and trail-terminated 
   scenarios; the former is essentially the single emulated loop model, 
   while the latter differs from the coupled-loop model in that failure 
   notifications are not propagated across the PW. 

   Since TDM is inherently real-time in nature, many OAM indications 
   must be generated or forwarded with essentially no delay. This 
   requirement rules out the use of messaging protocols, such as relying 
   on the PW status message. Thus, for TDM PWs, alternate mechanism are 
   employed. 


 
 
Nadeau, et al.         Expires August 27, 2009                [Page 26] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

   The fact that TDM PW packets are sent at a known constant rate is 
   used as an OAM mechanism. Thus, a PE enters the PW receive defect 
   state when a preconfigured number of TDM PW packets do not arrive in 
   a timely fashion. It exits this state when packets once again arrive 
   at the proper rate. 

   Native TDM carries OAM indications in overhead fields that travel 
   along with the data. TDM PWs emulate this behavior by sending urgent 
   OAM messages in the PWE control word. 

   The TDM PWE control word contains a set of flags used to indicate PW 
   and AC defect conditions. The L bit is an AC forward defect 
   indication used by the local PE to signal TDM network defects to the 
   remote PE. The M field may be used to modify the meaning of receive 
   defects. The R bit is a PW reverse defect indication used by the 
   local PE to signal PSN failures to the remote PE. Upon reception of 
   packets with the R-bit set, a PE enters the PW transmit defect state. 

11.1. AC receive defect state entry/exit criteria 

   PE1 enters the AC receive defect state if any of the following 
   conditions are met: 

               e. It detects a physical layer fault on the TDM interface 
                 (Loss of Signal, Loss of Alignment, etc (see G.705)). 

               f. It is notified of a previous physical layer fault by 
                 detecting of AIS. 

   The exact conditions under which a PE enters and exits the AIS state 
   are defined in [ITU-T G.775]. Note that Loss of Signal and AIS 
   detection can be performed for both structure-agnostic and structure-
   aware TDM PW types. Note that structure-agnostic PEs can not detect 
   Loss of Alignment. 

11.2. AC transmit defect state entry/exit criteria 

   PE1 enters the AC transmit defect state when it detects RDI according 
   to the criteria in [ITU-T G.775]. Note that structure-agnostic PEs 
   can not detect RDI.  

    





 
 
Nadeau, et al.         Expires August 27, 2009                [Page 27] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

11.3. Consequent Actions 

11.3.1. PW receive defect state entry/exit 

   On entry to the PW receive defect state: 

               a. PE1 MUST commence AIS insertion into the corresponding 
                 TDM AC. 

               b. PE1 MUST set the R bit in all PW packets sent back to 
                 PE2. 

   On exit from the PW receive defect state: 

               c. PE1 MUST cease AIS insertion into the corresponding 
                 TDM AC. 

               d. PE1 MUST clear the R bit in all PW packets sent back 
                 to PE2. 

   Note that AIS generation can in general be performed by both 
   structure-aware and structure-agnostic PEs. 

11.3.2. PW transmit defect state entry/exit 

   On entry to the PW Transmit Defect State: 

              a. A structure-aware PE1 MUST commence RDI insertion into 
                 the corresponding AC. 

   On exit from the PW Transmit Defect State: 

               b. A structure-aware PE1 MUST cease RDI insertion into 
                 the corresponding AC. 

   Note that structure-agnostic PEs are not capable of injecting RDI 
   into an AC. 

11.3.3. AC receive defect state entry/exit 

   On entry to the AC receive defect state and when operating in the 
   "single emulated OAM loop" mode: 

               a. PE1 SHOULD overwrite the TDM data with AIS in the PW 
                 packets sent towards PE2.  

               b. PE1 MUST set the L bit in these packets. 
 
 
Nadeau, et al.         Expires August 27, 2009                [Page 28] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

               c. PE1 MAY omit the payload in order to conserve 
                 bandwidth. 

               d. A structure-aware PE1 SHOULD send RDI back towards 
                 CE1. 

               e. A structure-aware PE1 that detects a potentially 
                 correctable AC defect MAY use the M field to indicate 
                 this. 

   On exit from the AC receive defect state and when operating in the 
   "single emulated OAM loop" mode: 

               a. PE1 MUST cease overwriting PW content with AIS and 
                 return to forwarding valid TDM data in PW packets sent 
                 towards PE2. 

               b. PE1 MUST clear the notification bit in PW packets sent 
                 towards PE2. 

               c. A structure-aware PE1 MUST cease sending RDI towards 
                 CE1. 

                  

    

12. Procedures for CEP PW Service 

   The following procedures apply to SONET/SDH Circuit Emulation 
   ([RFC4842]). They are based on the single-emulated loop mode (see 
   section 7).  

   Since SONET and SDH are inherently real-time in nature, many OAM 
   indications must be generated or forwarded with essentially no delay. 
   This requirement rules out the use of messaging protocols, such as 
   relying on the PW status message. Thus, for CES PWs, alternate 
   mechanism are employed.  

   The CES PWE control word contains a set of flags used to indicate PW 
   and AC defect conditions. The L bit is a forward defect indication 
   used by the local PE to signal a defect in the attachment circuit to 
   the remote PE. The R bit is a PW reverse defect indication used by 
   the local PE to signal PSN failures to the remote PE. The combination 
   of N and P bit is used by the local PE to signal loss of pointer to 
   the remote PE.  

 
 
Nadeau, et al.         Expires August 27, 2009                [Page 29] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

    

   The fact that CES PW packets are sent at a known constant rate is 
   used as an OAM mechanism. Thus, a PE enters the PW receive defect 
   state it loses packet synchronization. It exits this state when it 
   regains packet synchronization. See [RFC4842] for further details. 

12.1. Defect states 

12.1.1. PW receive defect state entry/exit criteria 

   In addition to the conditions specified in section 8.2.1. PE1 will 
   enter the PW receive defect state if one of the following is true: 

      - it receives packets with the L bit set 

      - it receives packets with both the N and P bits set 

      - it loses packet synchronization 

12.1.2. PW transmit defect state entry/exit criteria 

   In addition to the conditions specified in section 8.2.2. PE1 will 
   enter the PW transmit defect state if it receives packets with the R 
   bit set. 

12.1.3. AC receive defect state entry/exit criteria 

   PE1 enters the AC receive defect state if any of the following 
   conditions are met: 

               a. It detects a physical layer fault on the TDM interface 
                 (Loss of Signal, Loss of Alignment, etc (see 
                 [appropriate SONET & SDH reference])). 

               b. It is notified of a previous physical layer fault by 
                 detecting of AIS. 

   The exact conditions under which a PE enters and exits the AIS state 
   are defined in [appropriate SONET & SDH reference]. 

12.1.4. AC transmit defect state entry/exit criteria 

   The AC transmit defect state is not valid for CES PWs. RDI signals 
   are forwarded transparently. 


 
 
Nadeau, et al.         Expires August 27, 2009                [Page 30] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

12.2. Consequent actions 

12.2.1. PW receive defect state entry/exit 

   On entry to the PW receive defect state: 

               a. PE1 MUST commence AIS-P/V insertion into the 
                 corresponding AC. 

               b. PE1 MUST set the R bit in all PW packets sent back to 
                 PE2. 

   On exit from the PW receive defect state: 

               a. PE1 MUST cease AIS-P/V insertion into the 
                 corresponding AC. 

               b. PE1 MUST clear the R bit in all PW packets sent back 
                 to PE2. 

   See [RFC4842] for further details. 

12.2.2. PW transmit defect state entry/exit 

   On entry to the PW Transmit Defect State: 

              a. A structure-aware PE1 MUST commence RDI insertion into 
                 the corresponding AC. 

   On exit from the PW Transmit Defect State: 

               a. A structure-aware PE1 MUST cease RDI insertion into 
                 the corresponding AC. 

12.2.3. AC receive defect state entry/exit 

   On entry to the AC receive defect state: 

               a. PE1 MUST set the L bit in these packets. 

               b. If Dynamic Bandwidth Allocation (DBA) has been 
                 enabled, PE1 MAY omit the payload in order to conserve 
                 bandwidth. 

               c. If Dynamic Bandwidth Allocation (DBA) is not enabled 
                 PE1 SHOULD insert AIS-V/P in the SDH/SONET client 
                 layer in the PW packets sent towards PE2.  
 
 
Nadeau, et al.         Expires August 27, 2009                [Page 31] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

   On exit from the AC receive defect state and when operating in the 
   "single emulated OAM loop" mode: 

               d. PE1 MUST cease overwriting PW content with AIS-P/V and 
                 return to forwarding valid data in PW packets sent 
                 towards PE2. 

               e. PE1 MUST clear the L bit in PW packets sent towards 
                 PE2. 

   See [RFC4842] for further details. 

13. Security Considerations 

   The mapping messages described in this document do not change the 
   security functions inherent in the actual messages. 

14. IANA Considerations 

   There are none at this time. 

15. References  

15.1. Normative References 

  [BFD] Katz, D., Ward, D., "Bidirectional Forwarding Detection", 
       Internet Draft <draft-ietf-bfd-base-03.txt>, July 2005  
       
  [FRF.19] Frame Relay Forum, "Frame Relay Operations, Administration, 
       and Maintenance Implementation Agreement", March 2001 
       
  [ICMP] Postel, J. "Internet Control Message Protocol" RFC 792  
   
  [ITU-T G.775] Recommendation G.775 "Loss of Signal (LOS), Alarm 
       Indication Signal(AIS) and Remote Defect Indication (RDI) defect 
       detection and clearance criteria for PDH signals", October 1998 
   
  [ITU-T I.610] Recommendation I.610 "B-ISDN operation and maintenance 
       principles and functions", February 1999  
       
  [ITU-T I.620] Recommendation I.620 "Frame relay operation and 
       maintenance principles and functions", October 1996  
       
  [ITU-T Q.933] Recommendation Q.933 "ISDN Digital Subscriber 
       Signalling System No. 1 (DSS1) Signalling specifications for 
       frame mode switched and permanent virtual connection control and 
       status monitoring" February 2003 
 
 
Nadeau, et al.         Expires August 27, 2009                [Page 32] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

           
  [RFC3931] Lau, J., et. al. "Layer Two Tunneling Protocol (Version 3", 
       RFC 3931, March 2005 
       
  [RFC4023] Worster. T., et al., "Encapsulating MPLS in IP or Generic 
       Routing Encapsulation (GRE)", RFC 4023, March 2005 
   
  [RFC4379] Kompella, K., et. al., "Detecting MPLS Data Plane 
       Failures", RFC4379, February 2006 
       
  [RFC4447] Martini, L., Rosen, E., Smith, T., "Pseudowire Setup and 
       Maintenance using LDP", RFC4447, April 2006 
   
  [RFC4842] Malis, A., et. al., "SONET/SDH Circuit Emulation over 
       Packet (CEP)", RFC 4842, April 2007  
   
  [RFC5085] Nadeau, T., et al., "Pseudo Wire Virtual Circuit Connection 
       Verification (VCCV)", RFC 5085, December 2007 
   
  [VCCV-BFD] Nadeau, T., Pignataro, C., "Bidirectional Forwarding 
       Detection (BFD) for the Pseudowire Virtual Circuit Connectivity 
       Verification (VCCV)", draft-ietf-pwe3-vccv-bfd-02, June 2008 
   
   
   
15.2. Informative References 

  [CONGESTION] Rosen, E., Bryant, S., Davie, B., "PWE3 Congestion 
       Control Framework", draft-ietf-pwe3-congestion-frmwk-01.txt, May 
       2008  
   
  [ETH-OAM-IWK] Mohan, D., et al., "MPLS and Ethernet OAM 
       Interworking", draft-mohan-pwe3-mpls-eth-oam-iwk-01, July 2008 
   
  [L2TP-Status] McGill, N. Pignataro, C., "L2TPv3 Extended Circuit 
       Status Values", draft-nmcgill-l2tpext-circuit-status-extensions- 
       01 (work in progress), June 2008. 
   
  [RFC3916] Xiao, X., McPherson, D., Pate, P., "Requirements for   
       Pseudo Wire Emulation Edge to-Edge (PWE3)", RFC 3916, September 
       2004  
   
  [RFC3985] Bryant, S., Pate, P., "PWE3 Architecture", RFC 3985, March 
       2005  
   
  [RFC4377] Nadeau, T. et.al., "OAM Requirements for MPLS Networks", 
          RFC4377, February 2006 
 
 
Nadeau, et al.         Expires August 27, 2009                [Page 33] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

   
  [RFC4446] Martini, L., et al., "IANA Allocations for pseudo 
          Wire Edge to Edge Emulation (PWE3)", RFC4446, 
          April 2006 
   
  [RFC4454]  Singh, S., Townsley, M., and C. Pignataro, "Asynchronous 
          Transfer Mode (ATM) over Layer 2 Tunneling Protocol 
          Version 3 (L2TPv3)", RFC 4454, May 2006 
   
  [RFC4553] A.Vainshtein, Y.(J) Stein, "Structure-Agnostic Time 
       Division Multiplexing (TDM) over Packet (SAToP)", RFC 4553, June 
       2006 
   
   
  [RFC4717] Martini, L., et al., "Encapsulation Methods for Transport 
          of ATM Cells/Frame Over IP and MPLS Networks", RFC4717, 
          December 2006 
   
   
   
  [RFC5086] A.Vainshtein et al., "Structure-Aware Time Division 
       Multiplexed (TDM) Circuit Emulation Service over Packet Switched 
       Network (CESoPSN)", RFC 5086, December 2007 
   
  [RFC5087] Y.(J) Stein et al., "Time Division Multiplexing over IP 
       (TDMoIP)", RFC 5087, December 2007 
   
16. Editor's Addresses 

   Mustapha Aissaoui   
   Alcatel-lucent   
   600 March Rd   
   Kanata, ON, Canada K2K 2E6   
   Email: mustapha.aissaoui@alcatel-lucent.com   
    
   Peter B. Busschbach  
   Alcatel-Lucent 
   67 Whippany Road              
   Whippany, NJ, 07981           
   Email: busschbach@alcatel-lucent.com 
    
   David Allan 
   Nortel Networks 
   3500 Carling Ave., 
   Ottawa, Ontario, CANADA 
   Email: dallan@nortel.com 

 
 
Nadeau, et al.         Expires August 27, 2009                [Page 34] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

    
   Luca Martini 
   Cisco Systems, Inc. 
   9155 East Nichols Avenue, Suite 400 
   Englewood, CO, 80112 
   Email: lmartini@cisco.com 
    
   Thomas D. Nadeau 
   BT 
   BT Centre 
   81 Newgate Street 
   London  EC1A 7AJ 
   United Kingdom 
   EMail: tom.nadeau@bt.com 
    
    
   Monique Morrow 
   Cisco Systems, Inc. 
   Glatt-com 
   CH-8301 Glattzentrum 
   Switzerland 
   EMail: mmorrow@cisco.com 
    
   Yaakov (Jonathan) Stein 
   RAD Data Communications 
   24 Raoul Wallenberg St., Bldg C 
   Tel Aviv  69719 
   ISRAEL 
   EMail: yaakov_s@rad.com 
    
    
 

Informative Appendix A: Native Service Management 

- Frame Relay Management 

   The management of Frame Relay Bearer Service (FRBS) connections can 
   be accomplished through two distinct methodologies:  
      
       a. Based on ITU-T Q.933 Annex A, Link Integrity Verification 
          procedure, where STATUS and STATUS ENQUIRY signaling messages 
          are sent using DLCI=0 over a given UNI and NNI physical link. 
          [ITU-T Q.933] 
       b. Based on FRBS LMI, and similar to ATM ILMI where LMI is 
          common in private Frame Relay networks.  
     
 
 
Nadeau, et al.         Expires August 27, 2009                [Page 35] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

   In addition, ITU-T I.620 addresses Frame Relay loopback, but the 
   deployment of this standard is relatively limited [ITU-T I.620].  
         
   It is possible to use either, or both, of the above options to 
   manage Frame Relay interfaces. This document will refer exclusively 
   to Q.933 messages.  
        
   The status of any provisioned Frame Relay PVC may be updated 
   through:  
          
        a. STATUS messages in response to STATUS ENQUIRY messages, these 
          are mandatory.  
        
        b. Optional unsolicited STATUS updates independent of STATUS 
          ENQUIRY (typically under the control of management system, 
          these updates can be sent periodically (continuous 
          monitoring) or only upon detection of specific defects based 
          on configuration.  
         
   In Frame Relay, a DLC is either up or down. There is no distinction 
   between different directions. To achieve commonality with other 
   technologies, down is represented as a receive defect. 
    
   Frame relay connection management is not implemented over the PW 
   using either of the techniques native to FR, therefore PW mechanisms 
   are used to synchronize the view each PE has of the remote NS/AC. A 
   PE will treat a remote NS/AC failure in the same way it would treat 
   a PW or PSN failure; that is using AC facing FR connection 
   management to notify the CE that FR is down. 
    

- ATM Management 

   ATM management and OAM mechanisms are much more evolved than those 
   of Frame Relay.  There are five broad management-related categories, 
   including fault management (FT), Performance management (PM), 
   configuration management (CM), Accounting management (AC), and 
   Security management (SM). ITU-T Recommendation I.610 describes the 
   functions for the operation and maintenance of the physical layer 
   and the ATM layer, that is, management at the bit and cell levels 
   [ITU-T I.610]. Because of its scope, this document will concentrate 
   on ATM fault management functions. Fault management functions 
   include the following:  
         
        a. Alarm indication signal (AIS)  
        b. Remote Defect indication (RDI).  
        c. Continuity Check (CC).  
 
 
Nadeau, et al.         Expires August 27, 2009                [Page 36] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

        d. Loopback (LB)  
         
   Some of the basic ATM fault management functions are described as 
   follows: Alarm indication signal (AIS) sends a message in the same 
   direction as that of the signal, to the effect that an error has 
   been detected.  
        
   Remote defect indication (RDI) sends a message to the transmitting 
   terminal that an error has been detected. RDI is also referred to as 
   the far-end reporting failure. Alarms related to the physical layer 
   are indicated using path AIS/RDI. Virtual path AIS/RDI and virtual 
   channel AIS/RDI are also generated for the ATM layer.  
         
   OAM cells (F4 and F5 cells) are used to instrument virtual paths and 
   virtual channels respectively with regard to their performance and 
   availability. OAM cells in the F4 and F5 flows are used for 
   monitoring a segment of the network and end-to-end monitoring. OAM 
   cells in F4 flows have the same VPI as that of the connection being 
   monitored. OAM cells in F5 flows have the same VPI and VCI as that 
   of the connection being monitored.  The AIS and RDI messages of the 
   F4 and F5 flows are sent to the other network nodes via the VPC or 
   the VCC to which the message refers. The type of error and its 
   location can be indicated in the OAM cells. Continuity check is 
   another fault management function. To check whether a VCC that has 
   been idle for a period of time is still functioning, the network 
   elements can send continuity-check cells along that VCC. 
    

Informative Appendix B: PW Defects and Detection tools 

- PW Defects 

   Possible defects that impact PWs are the following: 

         a. Physical layer defect in the PSN interface 

         b. PSN tunnel failure which results in a loss of connectivity 
           between ingress and egress PE. 

         c. Control session failures between ingress and egress PE 

   In case of an MPLS PSN and an MPLS-IP PSN there are additional 
   defects: 

         a. PW labeling error, which is due to a defect in the ingress 
           PE, or to an over-writing of the PW label value somewhere 
           along the LSP path. 
 
 
Nadeau, et al.         Expires August 27, 2009                [Page 37] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

         b. LSP tunnel Label swapping errors or LSP tunnel label merging 
           errors in the MPLS network. This could result in the 
           termination of a PW at the wrong egress PE. 

         c. Unintended self-replication; e.g., due to loops or denial-
           of-service attacks. 

- Packet Loss 

   Persistent congestion in the PSN or in a PE could impact the proper 
   operation of the emulated service. 

   A PE can detect packet loss resulting from congestion through several 
   methods. If a PE uses the sequence number field in the PWE3 Control 
   Word for a specific Pseudo Wire [RFC3985], it has the ability to 
   detect packet loss.  Translation of congestion detection to PW defect 
   states is outside the scope of this specification. 

   Generally, there are congestion alarms which are raised in the node 
   and to the management system when congestion occurs. The decision to 
   declare the PW Down and to select another path is usually at the 
   discretion of the network operator. 

- PW Defect Detection Tools 

   To detect the defects listed above, Service Providers have a variety 
   of options available. 

   Physical Layer defect detection and notification mechanisms such as 
   SONET/SDH LOS, LOF,and AIS/FERF. 

   PSN Defect Detection Mechanisms: 

   For PWE3 over an L2TP-IP PSN, with L2TP as encapsulation protocol, 
   the defect detection mechanisms described in [RFC3931] apply. This 
   includes for example the keepalive mechanism performed with Hello 
   messages for detection of loss of connectivity between a pair of 
   LCCEs (i.e., dead PE peer and path detection).  Furthermore, the 
   tools Ping and Traceroute, based on ICMP Echo Messages apply [RFC792] 
   and can be used to detect defects on the IP PSN.  Additionally, ICMP 
   Ping [RFC5085] and BFD [VCCV-BFD] can also be used with VCCV to 
   detect defects at the individual pseudowire level. 

   For PWE3 over an MPLS PSN and an MPLS-IP PSN, several tools can be 
   used. 


 
 
Nadeau, et al.         Expires August 27, 2009                [Page 38] 

Internet-Draft   Pseudo Wire (PW) OAM Message Mapping     February 2009 
    

         a. LSP-Ping and LSP-Traceroute( [RFC4379]) for LSP tunnel 
           connectivity verification. 

         b. LSP-Ping with Bi-directional Forwarding Detection ([BFD]) 
           for LSP tunnel continuity checking. 

         c. Furthermore, if RSVP-TE is used to setup the PSN Tunnels 
           between ingress and egress PE, the hello protocol can be 
           used to detect loss of connectivity [RFC3209], but only at 
           the control plane. 

   PW specific defect detection mechanisms: 

   [RFC4377] describes how LSP-Ping and BFD can be used over individual 
   PWs for connectivity verification and continuity checking 
   respectively. When used as such, we will refer to them as VCCV-Ping 
   and VCCV-BFD respectively. 

   Furthermore, the detection of a fault could occur at different points 
   in the network and there are several ways the observing PE determines 
   a fault exists: 

        a. egress or ingress PE detection of failure (e.g. BFD) 

        b. ingress PE detection of failure (e.g. LSP-PING) 

        c. ingress PE notification of failure (e.g. RSVP Path-err) 

      

 
















 
 
Nadeau, et al.         Expires August 27, 2009                [Page 39] 

